InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КурсыВалют/Ext/RecordSetModule.bsl
// Процедура - обработчик события ПередЗаписью
//
Процедура ПередЗаписью(Отказ, Замещение)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	КоличествоЗаписей = ЭтотОбъект.Количество();

	Если КоличествоЗаписей > 0 Тогда
		Для Сч = 0 По КоличествоЗаписей -1  Цикл
			Если (ЭтотОбъект[Сч].Кратность = 0) ИЛИ (ЭтотОбъект[Сч].Курс = 0) Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Кратность или курс не могут быть нулевыми!", Отказ);
				Возврат;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()


Процедура ПриЗаписи(Отказ, Замещение)
	//Керсанова нач
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	КоличествоЗаписей = ЭтотОбъект.Количество();
	
	Если НЕ Отказ Тогда
		Если КоличествоЗаписей > 0 Тогда
			Для Сч = 0 По КоличествоЗаписей -1  Цикл
				текВалюта = ЭтотОбъект[Сч].Валюта;
				ОбъектВалюта = текВалюта.ПолучитьОбъект();
				ОбъектВалюта.АктуальныйКурс = ЭтотОбъект[Сч].Курс; 
				Попытка
					ОбъектВалюта.Записать();
				Исключение	
					ОбщегоНазначения.СообщитьОбОшибке("Актуальный курс не записан в Валюту!", );
					//Возврат;
				КонецПопытки;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;	
	//Керсанова кон

КонецПроцедуры
